---
type: LoadCase
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 8
tags: [revit-api, class]
---

# LoadCase

`Autodesk.Revit.DB.Structure.LoadCase` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | IsLoadCaseSubcategoryId | — | `public bool IsLoadCaseSubcategoryId ( ElementId loadCaseSubcategoryId )` |
| Method | IsLoadNatureId | — | `public bool IsLoadNatureId ( ElementId natureId )` |
| Method | IsNumberUnique | — | `public static bool IsNumberUnique ( Document document , int number )` |
| Property | NatureId | 2016 | `public ElementId NatureId { get ; set ; }` |
| Property | Number | 2016 | `public int Number { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SubcategoryId | 2017 | `public ElementId SubcategoryId { get ; set ; }` |